In [ ]:
 # NBA

In [2]:
import pandas as pd

In [3]:
nba = pd.read_csv("nba.csv")
nba 

output = None

In [29]:
nba.index

RangeIndex(start=0, stop=458, step=1)

In [10]:
nba.shape

(458, 9)

In [12]:
nba.dtypes

Name         object
Team         object
Number      float64
Position     object
Age         float64
Height       object
Weight      float64
College      object
Salary      float64
dtype: object

In [6]:
nba.dtypes.value_counts()

object     5
float64    4
Name: count, dtype: int64

In [7]:
nba.dtypes

Name         object
Team         object
Number      float64
Position     object
Age         float64
Height       object
Weight      float64
College      object
Salary      float64
dtype: object

In [7]:
nba.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 458 entries, 0 to 457
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      457 non-null    object
 1   Team      457 non-null    object
 2   Number    457 non-null    float64
 3   Position  457 non-null    object
 4   Age       457 non-null    float64
 5   Height    457 non-null    object
 6   Weight    457 non-null    float64
 7   College   373 non-null    object
 8   Salary    446 non-null    float64
dtypes: float64(4), object(5)
memory usage: 32.3+ KB

In [14]:
nba = pd.read_csv("nba.csv")
nba 

output = None

In [16]:
nba["Sport"] = "Football"

In [4]:
nba["College"].fillna("No college")

0                  Texas
1              Marquette
2      Boston University
3          Georgia State
4             No college
             ...
453               Butler
454           No college
455           No college
456               Kansas
457           No college
Name: College, Length: 458, dtype: object

In [13]:
nba.head(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN

In [19]:
nba["Number"]

0       0.0
1      99.0
2      30.0
3      28.0
4       8.0
       ...
453     8.0
454    25.0
455    21.0
456    24.0
457     NaN
Name: Number, Length: 458, dtype: float64

In [36]:
nba = pd.read_csv("nba.csv")
nba 

output = None

In [37]:
nba.insert(4,column = "Sport", value = "Football")

In [38]:
nba.head(3)

,Name,Team,Number,Position,Sport,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,Football,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,Football,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,Football,27.0,6-5,205.0,Boston University,NaN

In [37]:
nba ["Age"].add(100)
nba ["Age"] + 50

0      75.0
1      75.0
2      77.0
3      72.0
4      79.0
       ...
453    76.0
454    74.0
455    76.0
456    76.0
457     NaN
Name: Age, Length: 458, dtype: float64

In [42]:
nba["adjusted weight"]= nba["Weight"]*0.50

In [8]:
nba[["Team", "Salary"]].head(4)
select=

             Team     Salary
0  Boston Celtics  7730337.0
1  Boston Celtics  6796117.0
2  Boston Celtics        NaN
3  Boston Celtics  1148640.0

In [12]:
nba["Age"]+5

0      30.0
1      30.0
2      32.0
3      27.0
4      34.0
       ...
453    31.0
454    29.0
455    31.0
456    31.0
457     NaN
Name: Age, Length: 458, dtype: float64

In [7]:
nba["Position"].value_counts()

Position
SG    102
PF    100
PG     92
SF     85
C      78
Name: count, dtype: int64

In [8]:
nba.tail(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [21]:
nba.head(5)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [21]:
nba.dropna(axis= 0).head(5)

nba.dropna(axis= 'index').head(5)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
6,Jordan Mickey,Boston Celtics,55.0,PF,21.0,6-8,235.0,LSU,1170960.0
7,Kelly Olynyk,Boston Celtics,41.0,C,25.0,7-0,238.0,Gonzaga,2165160.0

In [5]:
nba.dtypes

Name         object
Team         object
Number      float64
Position     object
Age         float64
Height       object
Weight      float64
College      object
Salary      float64
dtype: object

In [1]:
nba.head(6)

nba["Salary"].fillna(0, inplace = True)

nba["College"].fillna ("None", inplace = True)

NameError: name 'nba' is not defined

In [24]:
nba.head(6)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,0.0
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,None,5000000.0
5,Amir Johnson,Boston Celtics,90.0,PF,29.0,6-9,240.0,None,12000000.0

In [25]:
nba["Salary"].astype('int')

0      7730337
1      6796117
2            0
3      1148640
4      5000000
        ...
453    2433333
454     900000
455    2900000
456     947276
457          0
Name: Salary, Length: 458, dtype: int64

In [34]:
nba["Salary"] = nba["Salary"].astype('int')

In [35]:
nba.head(6)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,0
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,None,5000000
5,Amir Johnson,Boston Celtics,90.0,PF,29.0,6-9,240.0,None,12000000

In [36]:
nba["Position"].nunique()

5

In [ ]:
 # REVENUE EXAMPLE

In [7]:
revenue = pd.read_csv("revenue.csv")

revenue

      Date  New York  Los Angeles  Miami
0   1/1/16       985          122    499
1   1/2/16       738          788    534
2   1/3/16        14           20    933
3   1/4/16       730          904    885
4   1/5/16       114           71    253
5   1/6/16       936          502    497
6   1/7/16       123          996    115
7   1/8/16       935          492    886
8   1/9/16       846          954    823
9  1/10/16        54          285    216

In [4]:
revenue["New York"]

0    985
1    738
2     14
3    730
4    114
5    936
6    123
7    935
8    846
9     54
Name: New York, dtype: int64

In [8]:
revenue.info

<bound method DataFrame.info of       Date  New York  Los Angeles  Miami
0   1/1/16       985          122    499
1   1/2/16       738          788    534
2   1/3/16        14           20    933
3   1/4/16       730          904    885
4   1/5/16       114           71    253
5   1/6/16       936          502    497
6   1/7/16       123          996    115
7   1/8/16       935          492    886
8   1/9/16       846          954    823
9  1/10/16        54          285    216>

In [19]:
rev= pd.read_csv("revenue.csv", index_col= "Date")

In [21]:
rev.head(3)

        New York  Los Angeles  Miami
Date
1/1/16       985          122    499
1/2/16       738          788    534
1/3/16        14           20    933

In [22]:
rev.sum()

New York       5475
Los Angeles    5134
Miami          5641
dtype: int64

In [27]:
rev.sum(axis= "columns")

Date
1/1/16     1606
1/2/16     2060
1/3/16      967
1/4/16     2519
1/5/16      438
1/6/16     1935
1/7/16     1234
1/8/16     2313
1/9/16     2623
1/10/16     555
dtype: int64

In [33]:
revenue["adj New York"] = revenue["New York"]* 1.25

In [34]:
revenue

,Date,New York,Los Angeles,Miami,adjusted revenue for New York,adj New York
0,1/1/16,985,122,499,1231.25,1231.25
1,1/2/16,738,788,534,922.50,922.50
2,1/3/16,14,20,933,17.50,17.50
3,1/4/16,730,904,885,912.50,912.50
4,1/5/16,114,71,253,142.50,142.50
5,1/6/16,936,502,497,1170.00,1170.00
6,1/7/16,123,996,115,153.75,153.75
7,1/8/16,935,492,886,1168.75,1168.75
8,1/9/16,846,954,823,1057.50,1057.50
9,1/10/16,54,285,216,67.50,67.50

In [ ]:
 # CLEANACE DATABASE

In [26]:
cleanace = pd.read_csv("CleanAce.csv")
cleanace

output = None

In [20]:
cleanace ["Manager"] = "Segun Asoyinkule"

In [21]:
cleanace.head(3)

,Month,1st Avenue Sales,2nd Avenue Cash,Maryland Sales,Maryland Cash,Ogudu Sales,Ogudu Cash,4th Avenue Sales,5th Avenue Cash,Marina Sales,...,Victoria Island Cash,Lekki 1 Sales,Lekki 2 Cash,Ikosi Ketu Sales,Ikosi Ketu Cash,Chevron Sales,Chevron Cash,Abuja Sales,Abuja Cash,Manager
0,41275,4418253.56,3889895.0,3456562.3,3173755.0,1898188.25,1735210.0,1206761.2,779140.0,630519.25,...,0.0,0.0,0.0,0,0,0,0,0.0,0.0,Segun Asoyinkule
1,41306,4124033.00,4442853.0,3517797.0,3576122.0,1887387.00,1921310.0,876679.0,931505.0,601766.00,...,0.0,0.0,0.0,0,0,0,0,0.0,0.0,Segun Asoyinkule
2,41334,5118829.00,4890255.0,3897377.0,3814350.0,2035641.00,2003000.0,1208961.0,1141530.0,493573.00,...,0.0,0.0,0.0,0,0,0,0,0.0,0.0,Segun Asoyinkule

In [11]:
cleanace = pd.read_csv("CleanAce.csv")
cleanace

output = None

In [40]:
cleanace.insert(3, column= "Manager", value= "Segun")

In [12]:
cleanace.head(3)

,Month,1st Avenue Sales,2nd Avenue Cash,Maryland Sales,Maryland Cash,Ogudu Sales,Ogudu Cash,4th Avenue Sales,5th Avenue Cash,Marina Sales,...,Victoria Island Sales,Victoria Island Cash,Lekki 1 Sales,Lekki 2 Cash,Ikosi Ketu Sales,Ikosi Ketu Cash,Chevron Sales,Chevron Cash,Abuja Sales,Abuja Cash
0,41275,4418253.56,3889895.0,3456562.3,3173755.0,1898188.25,1735210.0,1206761.2,779140.0,630519.25,...,0.0,0.0,0.0,0.0,0,0,0,0,0.0,0.0
1,41306,4124033.00,4442853.0,3517797.0,3576122.0,1887387.00,1921310.0,876679.0,931505.0,601766.00,...,0.0,0.0,0.0,0.0,0,0,0,0,0.0,0.0
2,41334,5118829.00,4890255.0,3897377.0,3814350.0,2035641.00,2003000.0,1208961.0,1141530.0,493573.00,...,61000.0,0.0,0.0,0.0,0,0,0,0,0.0,0.0

In [16]:
cleanace.insert(3, column ="Adjusted Target", value = "2nd Avenue Cash")

In [32]:
cleanace["Maryland Sales"]= cleanace["Maryland Sales"].astype('int')

In [33]:
cleanace["Maryland Sales"].info

<bound method Series.info of 0     3456562
1     3517797
2     3897377
3     3924879
4     4378111
5     4149963
6     4319339
7     4593448
8     4412698
9     4311655
10    4837443
11    4669589
12    4812716
13    4237364
14    4798491
15    4623775
16    4709690
17    4282504
18    5352222
19    4656035
20    4580594
21    5125154
22    4877618
23    5729831
24    5044888
25    4298673
26    4274101
27    4472032
28    5121928
29    5102624
30    5343542
31    5067707
32    3235582
Name: Maryland Sales, dtype: int64>

In [31]:
cleanace.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33 entries, 0 to 32
Data columns (total 23 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Month                  33 non-null     int64
 1   1st Avenue Sales       33 non-null     float64
 2   2nd Avenue Cash        33 non-null     float64
 3   Maryland Sales         33 non-null     float64
 4   Maryland Cash          33 non-null     float64
 5   Ogudu Sales            33 non-null     float64
 6   Ogudu Cash             33 non-null     float64
 7   4th Avenue Sales       33 non-null     float64
 8   5th Avenue Cash        33 non-null     float64
 9   Marina Sales           33 non-null     float64
 10  Marina Cash            33 non-null     float64
 11  Yaba Sales             33 non-null     int64
 12  Yaba Cash              33 non-null     int64
 13  Victoria Island Sales  33 non-null     float64
 14  Victoria Island Cash   33 non-null     float64
 15  Lekki 1 Sales          33 non-null     float64
 16  Lekki 2 Cash           32 non-null     float64
 17  Ikosi Ketu Sales       33 non-null     int64
 18  Ikosi Ketu Cash        33 non-null     int64
 19  Chevron Sales          33 non-null     int64
 20  Chevron Cash           33 non-null     int64
 21  Abuja Sales            33 non-null     float64
 22  Abuja Cash             33 non-null     float64
dtypes: float64(16), int64(7)
memory usage: 6.1 KB

In [ ]:
cleanace